{"genres": [{
    "name": "fiction",
    "books": {"1":true, "2":true, "7":true, "8":true, "10":true, "11":true}
  }, {
    "name": "poetry",
    "books": {"5":true}
  }, {
    "name": "mystery",
    "books": {"9":true}
  }, {
    "name": "horror",
    "books": {"4":true, "6":true}
  }, {
    "name": "biography",
    "books": {"0":true, "3":true}
  }],
"books": [{
    "title": "Good Vibrations: My Life as a Beach Boy",
    "author": "Love, Mike",
    "genre": "4",
    "price": 28,
    "image": "http://images.penguinrandomhouse.com/cover/9780399176418",
    "pages": "448",
    "synopsis": "Mike Love tells the story of his legendary, raucous, and ultimately triumphant five-decade career as the front man of The Beach Boys, the most popular American band in history — timed to coincide with the 50th anniversary of 'Good Vibrations.' As a founding member of The Beach Boys, Mike Love has spent an extraordinary fifty-five years, and counting, as the group’s lead singer and one of its principal lyricists. The Beach Boys, from their California roots to their international fame, are a unique American story — one of overnight success and age-defying longevity; of musical genius and reckless self-destruction; of spirituality, betrayal, and forgiveness — and Love is the only band member to be part of it each and every step. His own story has never been fully told, of how a sheet-metal apprentice became the quintessential front man for America’s most successful rock band, singing in more than 5,600 concerts in 26 countries. Love describes the stories behind his lyrics for pop classics such as 'Good Vibrations,' 'California Girls,' 'Surfin' USA,' and 'Kokomo,' while providing vivid portraits of the turbulent lives of his three gifted cousins, Brian, Dennis, and Carl Wilson. His partnership with Brian has few equals in American pop music, though Mike has carved out a legacy of his own — he co-wrote the lyrics to eleven of the twelve original Beach Boy songs that were top 10 hits while providing the lead vocals on ten of them. The band’s unprecedented durability also provides a glimpse into America’s changing cultural mores over the past half century, while Love himself has experienced both the diabolical and the divine — from Charles Manson's 'family' threatening his life to Maharishi instilling it with peace. A husband, a father, and an avid environmentalist, Love has written a book that is as rich and layered as the Beach Boy harmonies themselves.",
    "publisher": "Blue Rider Press",
    "isbn": "9780399176418",
    "date": "09/13/2016",
    "quantity": "0"
  },{
    "title": "The Sellout",
    "author": "Beatty, Paul",
    "genre": "0",
    "price": 16,
    "image": "https://images-na.ssl-images-amazon.com/images/I/51gc1HCCV8L._SX331_BO1,204,203,200_.jpg",
    "pages": "304",
    "synopsis": "A biting satire about a young man's isolated upbringing and the race trial that sends him to the Supreme Court, Paul Beatty's The Sellout showcases a comic genius at the top of his game. It challenges the sacred tenets of the United States Constitution, urban life, the civil rights movement, the father-son relationship, and the holy grail of racial equality — the black Chinese restaurant. Born in the 'agrarian ghetto' of Dickens — on the southern outskirts of Los Angeles — the narrator of The Sellout resigns himself to the fate of lower-middle-class Californians: 'I'd die in the same bedroom I'd grown up in, looking up at the cracks in the stucco ceiling that've been there since 68 quake.' Raised by a single father, a controversial sociologist, he spent his childhood as the subject in racially charged psychological studies. He is led to believe that his father's pioneering work will result in a memoir that will solve his family's financial woes. But when his father is killed in a police shoot-out, he realizes there never was a memoir. All that's left is the bill for a drive-thru funeral. Fueled by this deceit and the general disrepair of his hometown, the narrator sets out to right another wrong: Dickens has literally been removed from the map to save California from further embarrassment. Enlisting the help of the town's most famous resident — the last surviving Little Rascal, Hominy Jenkins — he initiates the most outrageous action conceivable: reinstating slavery and segregating the local high school, which lands him in the Supreme Court.",
    "publisher": "Picador USA",
    "isbn": "9781250083258",
    "date": "03/01/2016",
    "quantity": "0"
  }, {
    "title": "To Kill a Mockingbird",
    "author": "Lee, Harper",
    "genre": "0",
    "price": 9,
    "image": "https://librarialpursuits.files.wordpress.com/2011/08/mockingbird.jpg",
    "pages": "384",
    "synopsis": "The unforgettable novel of a childhood in a sleepy Southern town and the crisis of conscience that rocked it, To Kill A Mockingbird became both an instant bestseller and a critical success when it was first published in 1960. It went on to win the Pulitzer Prize in 1961 and was later made into an Academy Award-winning film, also a classic. Compassionate, dramatic, and deeply moving, To Kill A Mockingbird takes readers to the roots of human behavior - to innocence and experience, kindness and cruelty, love and hatred, humor and pathos. Now with over 18 million copies in print and translated into forty languages, this regional story by a young Alabama woman claims universal appeal. Harper Lee always considered her book to be a simple love story. Today it is regarded as a masterpiece of American literature.",
    "publisher": "HarperLuxe",
    "isbn": "9780446310789",
    "date": "1960",
    "quantity": "0"
  }, {
    "title": "Between the World and Me",
    "author": "Coates, Ta-Nehisi",
    "genre": "4",
    "price": 25,
    "image": "https://cdn.theatlantic.com/assets/media/img/posts/2015/07/1_coates_between_the_world_and_me/50c0c9d1d.jpg",
    "pages": "176",
    "synopsis": "In a profound work that pivots from the biggest questions about American history and ideals to the most intimate concerns of a father for his son, Ta-Nehisi Coates offers a powerful new framework for understanding our nation’s history and current crisis. Americans have built an empire on the idea of “race,” a falsehood that damages us all but falls most heavily on the bodies of black women and men—bodies exploited through slavery and segregation, and, today, threatened, locked up, and murdered out of all proportion. What is it like to inhabit a black body and find a way to live within it? And how can we all honestly reckon with this fraught history and free ourselves from its burden? Between the World and Me is Ta-Nehisi Coates’s attempt to answer these questions in a letter to his adolescent son. Coates shares with his son—and readers—the story of his awakening to the truth about his place in the world through a series of revelatory experiences, from Howard University to Civil War battlefields, from the South Side of Chicago to Paris, from his childhood home to the living rooms of mothers whose children’s lives were taken as American plunder. Beautifully woven from personal narrative, reimagined history, and fresh, emotionally charged reportage, Between the World and Me clearly illuminates the past, bracingly confronts our present, and offers a transcendent vision for a way forward.",
    "publisher": "Spiegel & Grau",
    "isbn": "9780812993547",
    "date": "07/14/2015",
    "quantity": "0"
  }, {
    "title": "Library of Souls",
    "author": "Riggs, Ransom",
    "genre": "3",
    "price": 19,
    "image": "https://contentcafe2.btol.com/ContentCafe/Jacket.aspx?&userID=EBSCO9&password=TUSCONPL&Value=9781594747786&content=L&Return=1&Type=L",
    "pages": "464",
    "synopsis": "A boy with extraordinary powers. An army of deadly monsters. An epic battle for the future of peculiardom. The adventure that began with Miss Peregrine’s Home for Peculiar Children and continued in Hollow City comes to a thrilling conclusion with Library of Souls. As the story opens, sixteen-year-old Jacob discovers a powerful new ability, and soon he’s diving through history to rescue his peculiar companions from a heavily guarded fortress. Accompanying Jacob on his journey are Emma Bloom, a girl with fire at her fingertips, and Addison MacHenry, a dog with a nose for sniffing out lost children. They’ll travel from modern-day London to the labyrinthine alleys of Devil’s Acre, the most wretched slum in all of Victorian England. It’s a place where the fate of peculiar children everywhere will be decided once and for all. Like its predecessors, Library of Souls blends thrilling fantasy with never-before-published vintage photography to create a one-of-a-kind reading experience.",
    "publisher": "Quirk Books",
    "isbn": "9781594747588",
    "date": "09/22/2015",
    "quantity": "0"
  }, {
    "title": "Milk and Honey",
    "author": "Kaur, Rupi",
    "genre": "1",
    "price": 15,
    "image": "http://prodimage.images-bn.com/pimages/9781449474256_p0_v10_s1200x630.jpg",
    "pages": "208",
    "synopsis": "Milk and Honey is a collection of poetry and prose about survival. About the experience of violence, abuse, love, loss, and femininity. The book is divided into four chapters, and each chapter serves a different purpose. Deals with a different pain. Heals a different heartache. Milk and Honey takes readers through a journey of the most bitter moments in life and finds sweetness in them because there is sweetness everywhere if you are just willing to look.",
    "publisher": "Andrews McMeel Publishing",
    "isbn": "9781449474256",
    "date": "10/06/2015",
    "quantity": "0"
  }, {
    "title": "Ghostly: A Collection of Ghost Stories",
    "author": "Niffenegger, Audrey",
    "genre": "3",
    "price": 28,
    "image": "http://d28hgpri8am2if.cloudfront.net/book_images/onix/cvr9781501111198/ghostly-9781501111198_hr.jpg",
    "pages": "464",
    "synopsis": "From Edgar Allen Poe to Kelly Link, M.R. James to Neil Gaiman, H. H. Munro to Audrey Niffenegger herself, Ghostly reveals the evolution of the ghost story genre with tales going back to the eighteenth century and into the modern era, ranging across styles from Gothic Horror to Victorian, with a particular bent toward stories about haunting—haunted children, animals, houses. Every story is introduced by Audrey Niffenegger, an acclaimed master of the craft, with some words on its background and why she chose to include it. Niffenegger’s own story is, 'A Secret Life With Cats.' Perfect for the classic and contemporary ghost story aficionado, this is a delightful volume, beautifully illustrated. Ghostly showcases the best of the best in the field, including Edith Wharton, P.G. Wodehouse, A.S. Byatt, Ray Bradbury, and so many more.",
    "publisher": "Scribner",
    "isbn": "9781501111198",
    "date": "10/06/2015",
    "quantity": "0"
  }, {
    "title": "1Q84",
    "author": "Murakami, Haruki",
    "genre": "0",
    "price": 16,
    "image": "https://s-media-cache-ak0.pinimg.com/originals/8b/12/61/8b126152b8e3ab34226d41675d4d242b.jpg",
    "pages": "1184",
    "synopsis": "The year is 1984 and the city is Tokyo. A young woman named Aomame follows a taxi driver’s enigmatic suggestion and begins to notice puzzling discrepancies in the world around her. She has entered, she realizes, a parallel existence, which she calls 1Q84 —“Q is for ‘question mark.’ A world that bears a question.” Meanwhile, an aspiring writer named Tengo takes on a suspect ghostwriting project. He becomes so wrapped up with the work and its unusual author that, soon, his previously placid life begins to come unraveled. As Aomame’s and Tengo’s narratives converge over the course of this single year, we learn of the profound and tangled connections that bind them ever closer: a beautiful, dyslexic teenage girl with a unique vision; a mysterious religious cult that instigated a shoot-out with the metropolitan police; a reclusive, wealthy dowager who runs a shelter for abused women; a hideously ugly private investigator; a mild-mannered yet ruthlessly efficient bodyguard; and a peculiarly insistent television-fee collector. A love story, a mystery, a fantasy, a novel of self-discovery, a dystopia to rival George Orwell’s—1Q84 is Haruki Murakami’s most ambitious undertaking yet: an instant best seller in his native Japan, and a tremendous feat of imagination from one of our most revered contemporary writers.",
    "publisher": "Vintage",
    "isbn": "9780307476463",
    "date": "01/22/2013",
    "quantity": "0"
  }, {
    "title": "How We Are Hungry",
    "author": "Eggers, Dave",
    "genre": "0",
    "price": 15,
    "image": "http://bookcoverarchive.com/wp-content/uploads/amazon/how_we_are_hungry.jpg",
    "pages": "224",
    "synopsis": "Eggers presents his first collection of short stories. The characters are roaming, searching, and often struggling, and revelations do not always arrive on schedule. Precisely crafted and boldly experimental, How We Are Hungry simultaneously embraces and expands the boundaries of the short story.",
    "publisher": "Vintage",
    "isbn": "9781400095568",
    "date": "10/11/2005",
    "quantity": "0"
  }, {
    "title": "Slade House",
    "author": "Mitchell, David",
    "genre": "2",
    "price": 16,
    "image": "http://images.penguinrandomhouse.com/cover/9780812988079",
    "pages": "272",
    "synopsis": "Keep your eyes peeled for a small black iron door. Down the road from a working-class British pub, along the brick wall of a narrow alley, if the conditions are exactly right, you’ll find the entrance to Slade House. A stranger will greet you by name and invite you inside. At first, you won’t want to leave. Later, you’ll find that you can’t. Every nine years, the house’s residents—an odd brother and sister—extend a unique invitation to someone who’s different or lonely: a precocious teenager, a recently divorced policeman, a shy college student. But what really goes on inside Slade House? For those who find out, it’s already too late.... Spanning five decades, from the last days of the 1970s to the present, leaping genres, and barreling toward an astonishing conclusion, this intricately woven novel will pull you into a reality-warping new vision of the haunted house story—as only David Mitchell could imagine it.",
    "publisher": "Random House Trade",
    "isbn": "9780812988079",
    "date": "06/28/2016",
    "quantity": "0"
  }, {
    "title": "Delicious Foods",
    "author": "Hannaham, James",
    "genre": "0",
    "price": 16,
    "image": "https://img.washingtonpost.com/rw/2010-2019/WashingtonPost/2015/03/13/BookWorld/Images/Hannaham_DeliciousFoods.JPG?uuid=AJNTUsmoEeSqGoYTVZn7Dw",
    "pages": "384",
    "synopsis": "Held captive by her employers — and by her own demons — on a mysterious farm, a widow struggles to reunite with her young son in this uniquely American story of freedom, perseverance, and survival. Darlene, once an exemplary wife and a loving mother to her young son, Eddie, finds herself devastated by the unforeseen death of her husband. Unable to cope with her grief, she turns to drugs, and quickly forms an addiction. One day she disappears without a trace. Unbeknownst to eleven-year-old Eddie, now left behind in a panic-stricken search for her, Darlene has been lured away with false promises of a good job and a rosy life. A shady company named Delicious Foods shuttles her to a remote farm, where she is held captive, performing hard labor in the fields to pay off the supposed debt for her food, lodging, and the constant stream of drugs the farm provides to her and the other unfortunates imprisoned there.",
    "publisher": "Back Bay Books",
    "isbn": "9780316284936",
    "date": "01/19/2016",
    "quantity": "0"
  }, {
    "title": "Oryx and Crake",
    "author": "Atwood, Margaret",
    "genre": "0",
    "price": 14,
    "image": "http://bookcoverarchive.com/wp-content/uploads/amazon/oryx_and_crake.jpg",
    "pages": "272",
    "synopsis": "A stunning and provocative new novel by the internationally celebrated author of The Blind Assassin, winner of the Booker Prize. Margaret Atwood's new novel is so utterly compelling, so prescient, so relevant, so terrifyingly-all-too-likely-to-be-true, that readers may find their view of the world forever changed after reading it. The narrator of Atwood's riveting novel calls himself Snowman. When the story opens, he is sleeping in a tree, wearing an old bedsheet, mourning the loss of his beloved Oryx and his best friend Crake, and slowly starving to death. He searches for supplies in a wasteland where insects proliferate and pigoons and wolvogs ravage the pleeblands, where ordinary people once lived, and the Compounds that sheltered the extraordinary. As he tries to piece together what has taken place, the narrative shifts to decades earlier. How did everything fall apart so quickly? Why is he left with nothing but his haunting memories? Alone except for the green-eyed Children of Crake, who think of him as a kind of monster, he explores the answers to these questions in the double journey he takes--into his own past, and back to Crake's high-tech bubble-dome, where the Paradice Project unfolded and the world came to grief.",
    "publisher": "Knopf Doubleday Publishing Group",
    "isbn": "9781400078981",
    "date": "05/01/2004",
    "quantity": "0"
  }]
}
